Revit 2026 API

# ViewDisplayModel Class

---

Represents the settings for displaying model graphics. version 2: m_showHiddenLines type changed bool -> ShowHiddenLinesValues::Enum

SystemObject Autodesk.Revit.DBViewDisplayModel

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewDisplayModel : IDisposable
```
```vb
Public Class ViewDisplayModel
	Implements IDisposable
```
```cpp
public ref class ViewDisplayModel : IDisposable
```
```fsharp
type ViewDisplayModel =
    class
        interface IDisposable
    end
```

The ViewDisplayModel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EnableSilhouettes | True to show silhouettes edges. False to disable showing them. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ShowHiddenLines | True to enable hidden lines. False to disable showing them. |
|  | SilhouetteEdgesGStyleId | Style ID for silhouette edges |
|  | SmoothEdges | True to enable "smooth edge" (anti-aliasing) effect. False to disable it. |
|  | Transparency | The percentage (0..100) of surface transparency 0 means the surfaces are opaque, 100 means they are fully transparent |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ViewDisplayModel |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace